
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 1 to change, 8 to destroy.</code></pre>

* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
* Replace
  * azurerm_role_assignment.admin[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0]
  * azurerm_role_assignment.editors[0]
  * azurerm_role_assignment.more_viewers[0]
  * azurerm_role_assignment.platops[0]
  * azurerm_role_assignment.readers[0]
  * azurerm_role_assignment.viewers[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.admin[0] must be replaced
-/+ resource "azurerm_role_assignment" "admin" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/533244ed-6f36-b3e9-26d9-6ff5f318d0ce" -> (known after apply)
      ~ name                                   = "533244ed-6f36-b3e9-26d9-6ff5f318d0ce" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_aat_access" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/4fef2502-9a10-a9f3-2ce9-510180addc67" -> (known after apply)
      ~ name                                   = "4fef2502-9a10-a9f3-2ce9-510180addc67" -> (known after apply)
      ~ principal_id                           = "bd9f34b4-4c0c-489d-a8fd-c2ed7bf29db8" -> "8ba76f21-210f-46e4-8343-efb0574c53fc" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access" {
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/cd9f1675-a830-6954-57a9-db5f626735ba" -> (known after apply)
      ~ name                                   = "cd9f1675-a830-6954-57a9-db5f626735ba" -> (known after apply)
      ~ principal_id                           = "bd9f34b4-4c0c-489d-a8fd-c2ed7bf29db8" -> "8ba76f21-210f-46e4-8343-efb0574c53fc" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.editors[0] must be replaced
-/+ resource "azurerm_role_assignment" "editors" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/c41935f1-0f01-6261-314e-005cae0fecce" -> (known after apply)
      ~ name                                   = "c41935f1-0f01-6261-314e-005cae0fecce" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/a79a5197-3a5c-4973-a920-486035ffd60f" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.more_viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "more_viewers" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/c3c3e4ff-518e-e271-1b27-df5466f45d81" -> (known after apply)
      ~ name                                   = "c3c3e4ff-518e-e271-1b27-df5466f45d81" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.platops[0] must be replaced
-/+ resource "azurerm_role_assignment" "platops" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/238b4266-3901-bcae-514d-94c9129e50a6" -> (known after apply)
      ~ name                                   = "238b4266-3901-bcae-514d-94c9129e50a6" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.readers[0] must be replaced
-/+ resource "azurerm_role_assignment" "readers" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/3cbc6cc6-ac7d-4eae-5d94-56033357128c" -> (known after apply)
      ~ name                                   = "3cbc6cc6-ac7d-4eae-5d94-56033357128c" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ role_definition_name                   = "Grafana Viewer" -> "Grafana Readers" # forces replacement
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "viewers" {
      ~ id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat/providers/Microsoft.Authorization/roleAssignments/56687a79-b9b7-eeb5-a60b-adbc5fa6db43" -> (known after apply)
      ~ name                                   = "56687a79-b9b7-eeb5-a60b-adbc5fa6db43" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/60921a7e-fef1-4a43-9b16-a26c52ad4769" -> (known after apply)
      ~ scope                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-aat" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":164,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->